import { Post } from "../models/BigPost";
import { Category } from "../models/Category";

export const CATEGORIES_DATA: Category[] = [
    {
        title: "Македонија",
        mainPost: {
            title: "ЈП Градски паркинг започна со променето работно време и зимска наплата на паркингот",
            image: "parking.jpeg"
        },
        posts: [
            {
                title: "Грозданова: Комбинирањето на вакцините може да даде поголем имунитет",
                image: "grozdanova.jpeg"
            },
            {
                title: "Грозданова: Комбинирањето на вакцините може да даде поголем имунитет",
                image: "grozdanova.jpeg"
            },
            {
                title: "Грозданова: Комбинирањето на вакцините може да даде поголем имунитет",
                image: "grozdanova.jpeg"
            },
        ]
    },
    {
        title: "Македонија",
        mainPost: {
            title: "ЈП Градски паркинг започна со променето работно време и зимска наплата на паркингот",
            image: "parking.jpeg"
        },
        posts: [
            {
                title: "Грозданова: Комбинирањето на вакцините може да даде поголем имунитет",
                image: "grozdanova.jpeg"
            },
            {
                title: "Грозданова: Комбинирањето на вакцините може да даде поголем имунитет",
                image: "grozdanova.jpeg"
            },
            {
                title: "Грозданова: Комбинирањето на вакцините може да даде поголем имунитет",
                image: "grozdanova.jpeg"
            },
        ]
    },
    {
        title: "Македонија",
        mainPost: {
            title: "ЈП Градски паркинг започна со променето работно време и зимска наплата на паркингот",
            image: "parking.jpeg"
        },
        posts: [
            {
                title: "Грозданова: Комбинирањето на вакцините може да даде поголем имунитет",
                image: "grozdanova.jpeg"
            },
            {
                title: "Грозданова: Комбинирањето на вакцините може да даде поголем имунитет",
                image: "grozdanova.jpeg"
            },
            {
                title: "Грозданова: Комбинирањето на вакцините може да даде поголем имунитет",
                image: "grozdanova.jpeg"
            },
        ]
    },
    {
        title: "Македонија",
        mainPost: {
            title: "ЈП Градски паркинг започна со променето работно време и зимска наплата на паркингот",
            image: "parking.jpeg"
        },
        posts: [
            {
                title: "Грозданова: Комбинирањето на вакцините може да даде поголем имунитет",
                image: "grozdanova.jpeg"
            },
            {
                title: "Грозданова: Комбинирањето на вакцините може да даде поголем имунитет",
                image: "grozdanova.jpeg"
            },
            {
                title: "Грозданова: Комбинирањето на вакцините може да даде поголем имунитет",
                image: "grozdanova.jpeg"
            },
        ]
    },
];

export const POST_CATEGORY_POSTS: Post[] = [
    {
        title: "Без струја во понеделник делови од Сарај, Ѓорче Петров и Кисела Вода",
        smallerTitle: "Без електрична енергија во понеделник (4 октомври) ќе останат дел од корисниците од општините Сарај, Ѓорче Петров и Кисела Вода, соопштуваат од РЦУК – Скопје. Во периодот од 9:00 до 14:00 часот, б",
        category: "Македонија",
        image: "jok-struja.jpeg",
        dateAdded: "02.10.2021",
        timeAdded: '21:00',
        views: 0,
        source: 'negde.mk'
    },
    {
        title: "Без струја во понеделник делови од Сарај, Ѓорче Петров и Кисела Вода",
        smallerTitle: "Без електрична енергија во понеделник (4 октомври) ќе останат дел од корисниците од општините Сарај, Ѓорче Петров и Кисела Вода, соопштуваат од РЦУК – Скопје. Во периодот од 9:00 до 14:00 часот, б",
        category: "Македонија",
        image: "jok-struja.jpeg",
        dateAdded: "02.10.2021",
        timeAdded: '21:00',
        views: 0,
        source: 'negde.mk'
    },
    {
        title: "Без струја во понеделник делови од Сарај, Ѓорче Петров и Кисела Вода",
        smallerTitle: "Без електрична енергија во понеделник (4 октомври) ќе останат дел од корисниците од општините Сарај, Ѓорче Петров и Кисела Вода, соопштуваат од РЦУК – Скопје. Во периодот од 9:00 до 14:00 часот, б",
        category: "Македонија",
        image: "jok-struja.jpeg",
        dateAdded: "02.10.2021",
        timeAdded: '21:00',
        views: 0,
        source: 'negde.mk'
    }
]