import { BigPost, Post } from "../models/BigPost";

export const BIG_POST: BigPost = {
    title: "ФОТО: Балканскиот рис се врати на Галичица по неколку децении",
    smallerTitle: "По пауза од неколку децении, повторно е евидентирано присуство на балканскиот рис во Национален парк „Галичица“",
    category: "Македонија",
    image: "police-tape.jpg"
}

export const RECENT_POSTS: Post[] = [
    {
        title: "Шилегов: Институциите да го расчистат случајот со извидничкиот камп",
        smallerTitle: "Градот Скопје секоја година финансира илјадници различни програми. Не можеме ние да ги предвидуваме сите дејствија кои што ќе ги прави корисник",
        category: "Македонија",
        image: "silegov.jpeg",
        dateAdded: "02.10.2021",
        timeAdded: '21:00',
        views: 0,
        source: 'negde.mk'
    },
    {
        title: "Шилегов: Институциите да го расчистат случајот со извидничкиот камп",
        smallerTitle: "Градот Скопје секоја година финансира илјадници различни програми. Не можеме ние да ги предвидуваме сите дејствија кои што ќе ги прави корисник",
        category: "Македонија",
        image: "silegov.jpeg",
        dateAdded: "02.10.2021",
        timeAdded: '21:00',
        views: 0,
        source: 'negde.mk'
    }
];

export const MOST_VIEWS_POSTS: Post[] = [
    {
        title: "Без струја во понеделник делови од Сарај, Ѓорче Петров и Кисела Вода",
        smallerTitle: "Без електрична енергија во понеделник (4 октомври) ќе останат дел од корисниците од општините Сарај, Ѓорче Петров и Кисела Вода, соопштуваат од РЦУК – Скопје. Во периодот од 9:00 до 14:00 часот, б",
        category: "Македонија",
        image: "jok-struja.jpeg",
        dateAdded: "02.10.2021",
        timeAdded: '21:00',
        views: 0,
        source: 'negde.mk'
    },
    {
        title: "Без струја во понеделник делови од Сарај, Ѓорче Петров и Кисела Вода",
        smallerTitle: "Без електрична енергија во понеделник (4 октомври) ќе останат дел од корисниците од општините Сарај, Ѓорче Петров и Кисела Вода, соопштуваат од РЦУК – Скопје. Во периодот од 9:00 до 14:00 часот, б",
        category: "Македонија",
        image: "jok-struja.jpeg",
        dateAdded: "02.10.2021",
        timeAdded: '21:00',
        views: 0,
        source: 'negde.mk'
    },
    {
        title: "Без струја во понеделник делови од Сарај, Ѓорче Петров и Кисела Вода",
        smallerTitle: "Без електрична енергија во понеделник (4 октомври) ќе останат дел од корисниците од општините Сарај, Ѓорче Петров и Кисела Вода, соопштуваат од РЦУК – Скопје. Во периодот од 9:00 до 14:00 часот, б",
        category: "Македонија",
        image: "jok-struja.jpeg",
        dateAdded: "02.10.2021",
        timeAdded: '21:00',
        views: 0,
        source: 'negde.mk'
    },
    {
        title: "Без струја во понеделник делови од Сарај, Ѓорче Петров и Кисела Вода",
        smallerTitle: "Без електрична енергија во понеделник (4 октомври) ќе останат дел од корисниците од општините Сарај, Ѓорче Петров и Кисела Вода, соопштуваат од РЦУК – Скопје. Во периодот од 9:00 до 14:00 часот, б",
        category: "Македонија",
        image: "jok-struja.jpeg",
        dateAdded: "02.10.2021",
        timeAdded: '21:00',
        views: 0,
        source: 'negde.mk'
    },
    {
        title: "Без струја во понеделник делови од Сарај, Ѓорче Петров и Кисела Вода",
        smallerTitle: "Без електрична енергија во понеделник (4 октомври) ќе останат дел од корисниците од општините Сарај, Ѓорче Петров и Кисела Вода, соопштуваат од РЦУК – Скопје. Во периодот од 9:00 до 14:00 часот, б",
        category: "Македонија",
        image: "jok-struja.jpeg",
        dateAdded: "02.10.2021",
        timeAdded: '21:00',
        views: 0,
        source: 'negde.mk'
    },
    {
        title: "Без струја во понеделник делови од Сарај, Ѓорче Петров и Кисела Вода",
        smallerTitle: "Без електрична енергија во понеделник (4 октомври) ќе останат дел од корисниците од општините Сарај, Ѓорче Петров и Кисела Вода, соопштуваат од РЦУК – Скопје. Во периодот од 9:00 до 14:00 часот, б",
        category: "Македонија",
        image: "jok-struja.jpeg",
        dateAdded: "02.10.2021",
        timeAdded: '21:00',
        views: 0,
        source: 'negde.mk'
    },
]

export const SINGLE_POST_DATA: Post = {
    title: "ФОТО: Балканскиот рис се врати на Галичица по неколку децении",
    smallerTitle: "По пауза од неколку децении, повторно е евидентирано присуство на балканскиот рис во Национален парк „Галичица“",
    category: "Македонија",
    image: "police-tape.jpg",
    dateAdded: "02.10.2021",
    timeAdded: '21:00',
    views: 0,
    source: 'negde.mk',
    text: "Oпштините, истакна на денешната прес-конференција потпретседателот на ВМРО-ДПМНЕ, Владо Мисајловски.Ова се кандидатите кои ќе ја сочинуваат новата генерација на луѓе кои ќе настапат на политичката сцена и ќе го креираат развојот на општините во нашата земја.Нашата цел е да одиме на победа, да ги решаваме проблемите и да работиме за развојот на Република Македонија. Изборот е помеѓу стари, компромитирани кадри на власта, и нови луѓе, кои носат свежина и компетентност за големи чекори напред за сите луѓе во Македонија.Овие луѓе ќе ја направат разликата од се’ до сега што е актуелно присутно од власта. Одговорност, наспроти мрзеливост, чесност наспроти корупција. Одиме на победа за нови успеси на општините.1. Победата во Ѓорче Петров ќе ја издвојува доктор Александар Стојковски.Стојковски е доктор – радиолог на Универзитетската клиника за радиологија.Долгогодишен член на Општинскиот комитет на ВМРО-ДПМНЕ во Ѓорче Петров и активист од Унијата на младисили на ВМРО-ДПМНЕ.Поранешен Пратеник во Собранието и член на Советот на Општина Ѓорче Петров.Неговата љубов е спорт, планинарењето и велосипедизам. Тој е сопруг и татко на два сина.Човек со невиден ентузијазам, желба за создавање и љубов кон Ѓорче Петров. За промени, за решавање на проблеми, за нов лик на Ѓорче Петров.2. Кандидат за градоначалник на Куманово е признатиот актер Тони Михајловски.Роден во Куманово, а признат македонски театарски, филмски и телевизиски глумец, водител на радио ителевизија и стоечки комичар.Тој е сопруг и татко на два сина.Добитник на бројни признанија од светот на уметноста, како наградата за најдобар глумец на петтиотмеѓуна"
}